Web Services/request_obtener_oportunities_by_partyId.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/sales/opptyMgmt/opportunities/opportunityService/types/" xmlns:typ1="http://xmlns.oracle.com/adf/svc/types/">
	<soapenv:Header/>
	<soapenv:Body>
	<typ:findOpportunity>
		<typ:findCriteria>
		<typ1:fetchStart>0</typ1:fetchStart>
		<typ1:fetchSize>-1</typ1:fetchSize>
		<typ1:filter>
			<typ1:group>
			<typ1:conjunction>And</typ1:conjunction>
			<typ1:item>
				<typ1:conjunction>And</typ1:conjunction>
				<typ1:upperCaseCompare>false</typ1:upperCaseCompare>
				<typ1:attribute>TargetPartyId</typ1:attribute>
				<typ1:operator>=</typ1:operator>
				<typ1:value>300000018984284</typ1:value>
			</typ1:item>
			<typ1:item>
			    <typ1:conjunction>And</typ1:conjunction>
			    <typ1:upperCaseCompare>false</typ1:upperCaseCompare>
			    <typ1:attribute>ChildRevenue</typ1:attribute>
			    <typ1:nested>
			    <typ1:group>
			     	<typ1:item>
			          <typ1:attribute>ProdGroupId</typ1:attribute>
			          <typ1:operator>=</typ1:operator>
			          <typ1:value>300000017127709</typ1:value>
			          </typ1:item>
			    </typ1:group>
			    </typ1:nested>
			</typ1:item>
			</typ1:group>
		</typ1:filter>
		<typ1:findAttribute>Name</typ1:findAttribute>
		<typ1:findAttribute>OptyId</typ1:findAttribute>
		<typ1:findAttribute>CTREtapaPago_c</typ1:findAttribute>
		<typ1:findAttribute>CTRObsGenerales_c</typ1:findAttribute>
		<typ1:findAttribute>SalesStageId</typ1:findAttribute>
		<typ1:findAttribute>CTRSubEtapaVentas_c</typ1:findAttribute>
		<typ1:findAttribute>ChildRevenue</typ1:findAttribute>
		<typ1:childFindCriteria>
			<typ1:findAttribute>ProdGroupId</typ1:findAttribute>
			<typ1:childAttrName>ChildRevenue</typ1:childAttrName>
		</typ1:childFindCriteria> 
		</typ:findCriteria>
	    <typ:findControl>
			<typ1:retrieveAllTranslations>false</typ1:retrieveAllTranslations>
		</typ:findControl>
		</typ:findOpportunity>
	</soapenv:Body>
</soapenv:Envelope>